resources/json/nfse-keyword-model-dictionary.json

[{
    "model": "abrasf1.00",
    "filename": "abrasf1.00.xsd",
    "nfseKeyword": [
        {
            "name": "riodejaneiro",
            "webserviceUrl": {
                "homologation": "https://homologacao.notacarioca.rio.gov.br/WSNacional/nfse.asmx?wsdl",
                "production": "https://notacarioca.rio.gov.br/WSNacional/nfse.asmx?wsdl"
            },
            "envelopment": [{
                "action": "enviarLoteRps",
                "xml": "<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:not=\"http://notacarioca.rio.gov.br/\"><soapenv:Header/><soapenv:Body><not:RecepcionarLoteRpsRequest><not:inputXML><![CDATA[__xml__]]></not:inputXML></not:RecepcionarLoteRpsRequest></soapenv:Body></soapenv:Envelope>",
                "soapAction": "http://notacarioca.rio.gov.br/RecepcionarLoteRps",
                "particularities": [
                    {
                        "tag": "EnviarLoteRpsEnvio",
                        "attributes": [{
                            "attributeName": "xmlns",
                            "attributeValue": "http://www.abrasf.org.br/ABRASF/arquivos/nfse.xsd"
                        }]
                    }, {
                        "tag": "LoteRps",
                        "attributes": [{
                            "attributeName": "Id",
                            "attributeValue": "_uniqueValue"
                        }],
                        "isSigned": "LoteRps"
                    }, {
                        "tag": "InfRps",
                        "attributes": [{
                            "attributeName": "xmlns",
                            "attributeValue": "http://www.abrasf.org.br/ABRASF/arquivos/nfse.xsd"
                        }, {
                            "attributeName": "Id",
                            "attributeValue": "_uniqueValue"
                        }]
                    }
                ]
            }, {
                "action": "consultarLoteRps",
                "xml": "<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:not=\"http://notacarioca.rio.gov.br/\"><soapenv:Header/><soapenv:Body><not:ConsultarLoteRpsRequest><not:inputXML><![CDATA[__xml__]]></not:inputXML></not:ConsultarLoteRpsRequest></soapenv:Body></soapenv:Envelope>",
                "soapAction": "http://notacarioca.rio.gov.br/ConsultarLoteRps",
                "particularities": [
                    {
                        "tag": "ConsultarLoteRpsEnvio",
                        "attributes": [{
                            "attributeName": "xmlns",
                            "attributeValue": "http://www.abrasf.org.br/ABRASF/arquivos/nfse.xsd"
                        }]
                    }
                ]
            }]
        }, {
            "name": "issnetonline",
            "webserviceUrl": {
                "homologation": "http://www.issnetonline.com.br/webserviceabrasf/homologacao/servicos.asmx?WSDL",
                "production": "http://www.issnetonline.com.br/webserviceabrasf/producao/servicos.asmx?WSDL"
            },
            "envelopment": [{
                "action": "enviarLoteRps",
                "xml": "<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:not=\"http://notacarioca.rio.gov.br/\"><soapenv:Header/><soapenv:Body><not:RecepcionarLoteRpsRequest><not:inputXML><![CDATA[__xml__]]></not:inputXML></not:RecepcionarLoteRpsRequest></soapenv:Body></soapenv:Envelope>",
                "soapAction": "http://www.issnetonline.com.br/webservice/nfd/RecepcionarLoteRps",
                "particularities": [
                    {
                        "tag": "LoteRps",
                        "isSigned": "LoteRps"
                    }
                ]
            }, {
                "action": "consultarLoteRps",
                "xml": "<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:not=\"http://notacarioca.rio.gov.br/\"><soapenv:Header/><soapenv:Body><not:ConsultarLoteRpsRequest><not:inputXML><![CDATA[__xml__]]></not:inputXML></not:ConsultarLoteRpsRequest></soapenv:Body></soapenv:Envelope>",
                "soapAction": "http://www.issnetonline.com.br/webservice/nfd/ConsultarLoteRps"
            }]
        }, {
            "name": "ginfes",
            "webserviceUrl": {
                "homologation": "https://homologacao.ginfes.com.br/ServiceGinfesImpl?wsdl",
                "production": "https://producao.ginfes.com.br/ServiceGinfesImpl?wsdl"
            },
            "envelopment": [{
                "action": "enviarLoteRps",
                "xml": "<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\"><soap:Body><ns1:RecepcionarLoteRpsV3 xmlns:ns1=\"http://homologacao.ginfes.com.br\"><arg0><ns2:cabecalho versao=\"3\" xmlns:ns2=\"http://www.ginfes.com.br/cabecalho_v03.xsd\"><versaoDados>3</versaoDados></ns2:cabecalho></arg0><arg1>__xml__</arg1></ns1:RecepcionarLoteRpsV3></soap:Body></soap:Envelope>",
                "particularities": [
                    {
                        "tag": "EnviarLoteRpsEnvio",
                        "attributes": [{
                            "attributeName": "xmlns:ns3",
                            "attributeValue": "http://www.ginfes.com.br/servico_enviar_lote_rps_envio_v03.xsd"
                        }, {
                            "attributeName": "xmlns:ns4",
                            "attributeValue": "http://www.ginfes.com.br/tipos_v03.xsd"
                        }]
                    }, {
                        "tag": "LoteRps",
                        "attributes": [{
                            "attributeName": "Id",
                            "attributeValue": "_uniqueValue"
                        }],
                        "isSigned": "LoteRps"
                    }, {
                        "tag": "InfRps",
                        "attributes": [{
                            "attributeName": "Id",
                            "attributeValue": "_uniqueValue"
                        }]
                    }
                ],
                "prefixes": [{
                    "description": "ns3:",
                    "tagsToAdd": ["EnviarLoteRpsEnvio", "LoteRps"]
                }, {
                    "description": "ns4:",
                    "tagsToNotAdd": ["EnviarLoteRpsEnvio", "LoteRps"]
                }]
            }, {
                "action": "consultarLoteRps",
                "xml": "<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:not=\"http://notacarioca.rio.gov.br/\"><soapenv:Header/><soapenv:Body><not:ConsultarLoteRpsRequest><not:inputXML><![CDATA[__xml__]]></not:inputXML></not:ConsultarLoteRpsRequest></soapenv:Body></soapenv:Envelope>",
                "soapAction": "http://notacarioca.rio.gov.br/ConsultarLoteRps",
                "particularities": [
                    {
                        "tag": "ConsultarLoteRpsEnvio",
                        "attributes": [{
                            "attributeName": "xmlns",
                            "attributeValue": "http://www.abrasf.org.br/ABRASF/arquivos/nfse.xsd"
                        }]
                    }
                ]
            }]
        }, {
            "name": "portoalegre",
            "webserviceUrl": {
                "homologation": "https://nfse-hom.procempa.com.br/bhiss-ws/nfse?wsdl",
                "production": "https://nfe.portoalegre.rs.gov.br/bhiss-ws/nfse?wsdl"
            },
            "envelopment": [{
                "action": "enviarLoteRps",
                "xml": "<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:not=\"http://ws.bhiss.pbh.gov.br\"><soapenv:Header/><soapenv:Body><not:RecepcionarLoteRpsRequest><nfseCabecMsg><![CDATA[<cabecalho xmlns=\"http://www.abrasf.org.br/nfse.xsd\" versao=\"1.00\"><versaoDados>1.00</versaoDados></cabecalho>]]></nfseCabecMsg><nfseDadosMsg><![CDATA[__xml__]]></nfseDadosMsg></not:RecepcionarLoteRpsRequest></soapenv:Body></soapenv:Envelope>",
                "soapAction": "http://ws.bhiss.pbh.gov.br/RecepcionarLoteRps",
                "particularities": [
                    {
                        "tag": "EnviarLoteRpsEnvio",
                        "attributes": [{
                            "attributeName": "xmlns",
                            "attributeValue": "http://www.abrasf.org.br/nfse.xsd"
                        }]
                    }, {
                        "tag": "LoteRps",
                        "attributes": [{
                            "attributeName": "Id",
                            "attributeValue": "_uniqueValue"
                        }, {
                            "attributeName": "versao",
                            "attributeValue": "1.00"
                        }],
                        "isSigned": "LoteRps"
                    }, {
                        "tag": "InfRps",
                        "attributes": [{
                            "attributeName": "xmlns",
                            "attributeValue": "http://www.abrasf.org.br/nfse.xsd"
                        }, {
                            "attributeName": "Id",
                            "attributeValue": "_uniqueValue"
                        }]
                    }
                ]
            }, {
                "action": "consultarLoteRps",
                "xml": "<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:not=\"http://ws.bhiss.pbh.gov.br\"><soapenv:Header/><soapenv:Body><not:ConsultarLoteRpsRequest><nfseCabecMsg><![CDATA[<cabecalho xmlns=\"http://www.abrasf.org.br/nfse.xsd\" versao=\"1.00\"><versaoDados>1.00</versaoDados></cabecalho>]]></nfseCabecMsg><nfseDadosMsg><![CDATA[__xml__]]></nfseDadosMsg></not:ConsultarLoteRpsRequest></soapenv:Body></soapenv:Envelope>",
                "soapAction": "http://ws.bhiss.pbh.gov.br/ConsultarLoteRps",
                "particularities": [
                    {
                        "tag": "ConsultarLoteRpsEnvio",
                        "attributes": [{
                            "attributeName": "xmlns",
                            "attributeValue": "http://www.abrasf.org.br/nfse.xsd"
                        }]
                    }
                ]
            }]
        }
    ]
}, {
    "model": "abrasf2.01",
    "filename": "abrasf2.01.xsd",
    "nfseKeyword": [
        {
            "name": "catalao",
            "webserviceUrl": {
                "homologation": "http://200.23.238.210:8585/prodataws/services/NfseWSService?wsdl",
                "production": "http://200.23.238.210/prodataws/services/NfseWSService?wsdl"
            },
            "envelopment": [{
                "action": "enviarLoteRps",
                "xml": "<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:ser=\"http://services.nfse\"><soapenv:Header/><soapenv:Body><ser:RecepcionarLoteRpsRequest><nfseCabecMsg><![CDATA[<cabecalho xmlns=\"http://www.abrasf.org.br/nfse.xsd\" versao=\"2.01\"><versaoDados>1.00</versaoDados></cabecalho>]]></nfseCabecMsg><nfseDadosMsg><![CDATA[__xml__]]></nfseDadosMsg></ser:RecepcionarLoteRpsRequest></soapenv:Body></soapenv:Envelope>",
                "particularities": [
                    {
                        "tag": "EnviarLoteRpsEnvio",
                        "attributes": [{
                            "attributeName": "xmlns",
                            "attributeValue": "http://www.abrasf.org.br/nfse.xsd"
                        }]
                    }, {
                        "tag": "LoteRps",
                        "attributes": [{
                            "attributeName": "Id",
                            "attributeValue": "_uniqueValue"
                        }, {
                            "attributeName": "versao",
                            "attributeValue": "2.01"
                        }],
                        "isSigned": "LoteRps"
                    }, {
                        "tag": "InfDeclaracaoPrestacaoServico",
                        "attributes": [{
                            "attributeName": "Id",
                            "attributeValue": "_uniqueValue"
                        }],
                        "isSigned": "InfDeclaracaoPrestacaoServico"
                    }
                ]
            }, {
                "action": "consultarLoteRps",
                "xml": "<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:not=\"http://notacarioca.rio.gov.br/\"><soapenv:Header/><soapenv:Body><not:ConsultarLoteRpsRequest><not:inputXML><![CDATA[__xml__]]></not:inputXML></not:ConsultarLoteRpsRequest></soapenv:Body></soapenv:Envelope>",
                "soapAction": "http://notacarioca.rio.gov.br/ConsultarLoteRps",
                "particularities": [
                    {
                        "tag": "ConsultarLoteRpsEnvio",
                        "attributes": [{
                            "attributeName": "xmlns",
                            "attributeValue": "http://www.abrasf.org.br/ABRASF/arquivos/nfse.xsd"
                        }]
                    }
                ]
            }]
        }
    ]
}, {
    "model": "abrasf2.02",
    "filename": "abrasf2.02.xsd"
}, {
    "model": "abrasf2.04",
    "filename": "abrasf2.04.xsd"
}]